Revit 2026 API

# TransferredProjectStandardsEventArgs Class

---

The event arguments used by the TransferredProjectStandards event.

SystemObject SystemEventArgs Autodesk.Revit.DB.EventsRevitAPIEventArgs Autodesk.Revit.DB.EventsRevitAPISingleEventArgs Autodesk.Revit.UI.EventsTransferredProjectStandardsEventArgs

**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class TransferredProjectStandardsEventArgs : RevitAPISingleEventArgs
```
```vb
Public Class TransferredProjectStandardsEventArgs
	Inherits RevitAPISingleEventArgs
```
```cpp
public ref class TransferredProjectStandardsEventArgs : public RevitAPISingleEventArgs
```
```fsharp
type TransferredProjectStandardsEventArgs =
    class
        inherit RevitAPISingleEventArgs
    end
```

The TransferredProjectStandardsEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Cancellable | Indicates whether an event may be cancelled by an event delegate. (Inherited from RevitAPIEventArgs) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RevitAPIEventArgs) |
|  | SourceDocument | Source document. |
|  | TargetDocument | Target document. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from RevitAPIEventArgs) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetSelectedExternalItems | Gets the collection of externally added items that the user opted to enable for transfer in the Transfer Project Standards dialog. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsCancelled | Indicates whether the event is being cancelled. (Inherited from RevitAPIEventArgs) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.UI.Events Namespace